app/Http/Controllers/ToolController.php

select * from `tool_translations` where `tool_translations`.`tool_id` in (12)
---
    public function index(Request $request, $tool)
    {
        $tool = Tool::with('translations')->withCount('usageToday')->with('category')->slug($tool)->active()->firstOrFail();